Autodesk.Revit.DB.CurveUV.Transform(Autodesk.Revit.DB.Transform2D)
Transform this CurveUV by the given 2D affine transform if possible.
trfUV:
The given 2D affine transform.
Returns:
If successful a transformed CurveUV, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.CurveUV.GetEndParameter(System.Int32)
Gets the raw parameter value at the start or end of this curve.
index:
Use 0 for the start parameter, 1 for the end parameter of the curve.
Returns:
The raw parameter value at the start or end of this curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for index is not 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This curve is unbound and does not have start and end points.
Since:
2021

Autodesk.Revit.DB.CurveUV.ComputeDerivatives(System.Double,System.Boolean)
Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve.
parameter:
The specified parameter along the curve.
normalized:
If false, parameter is interpreted as natural parameterization of the curve. If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The array containing three members: the first derivative (at index [0]), the second derivative (at index [1]) and the unit tangent vector (at index [2]).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.
Since:
2021

Autodesk.Revit.DB.CurveUV.Evaluate(System.Double,System.Boolean)
Evaluates and returns the point at the specified parameter along the curve.
parameter:
The specified parameter along the curve.
normalized:
If false, parameter is interpreted as natural parameterization of the curve. If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The point evaluated along the curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.
Since:
2021

Autodesk.Revit.DB.CurveUV.As3DCurveInXYPlane
Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.
Remarks:
Ideally, this function should only be used in cases when the 2D curve needs to be used in a context
that does not support 2D curves, but can represent them as 3D curves with Z = 0 everywhere (for example,
converting the 2D curve to another CAD system that does not support 2D curves).
Returns:
3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.
Since:
2021

Autodesk.Revit.DB.CurveUV.Create(Autodesk.Revit.DB.Curve)
Create a CurveUV from a bounded 3D Curve lying in the XY plane.
Remarks:
The XY plane is identified with the uv parameter space of the surface to which this SurfParamSpaceCurve refers.
curve3D:
The input bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve).
Returns:
The newly created CurveUV.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Curve is not a bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.CurveUV.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveUV.IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
Since:
2021

Autodesk.Revit.DB.CurveUV
A class that encapsulates the notion of a curve in the 2D parameter space of a surface in 3D space.
Remarks:
Revit does not have a class to represent 2D curves explicitly.
Since:
2021